If true style has colored surface settings.
  Namespace:   Autodesk.Revit.DB.Analysis
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2012
 Syntax
  C#
public bool HasColoredSurfaceSettings()
  Visual Basic
Public Function HasColoredSurfaceSettings As Boolean
  Visual C++
public:
bool HasColoredSurfaceSettings()
 See Also
  AnalysisDisplayStyle Class
  Autodesk.Revit.DB.Analysis Namespace